app/controllers/movies_controller.rb

  def index
    @selected_movies = Movie.all_ratings
    if params[:ratings]
      @selected_movies = params[:ratings].keys
      session[:ratings] = params[:ratings]
    elsif session[:ratings]
      @selected_movies = session[:ratings].keys
    end

    if params[:sort]
      session[:sort] = params[:sort]
    end

    if (!params[:ratings] and session[:ratings]) or (!params[:sort] and session[:sort])
      flash.keep
      redirect_to :sort => session[:sort], :ratings => session[:ratings]
    end

    @movies = Movie.find(:all, :conditions => ["rating IN (?)", @selected_movies], :order => [session[:sort]])
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('PG')) ORDER BY release_date